In [79]:
pip install pandas

Requirement already satisfied: pandas in c:\users\dell 4\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dell 4\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell 4\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell 4\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dell 4\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\dell 4\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

# Series

In [81]:
import pandas as pd

In [82]:
my_list=[1,2,3,4,5,6]
series_data=pd.Series(my_list)
index_data=pd.Series(my_list,index=["X","Y","Z","A","B","C"])

In [83]:
series_data

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [84]:
index_data

X    1
Y    2
Z    3
A    4
B    5
C    6
dtype: int64

In [85]:
my_dict={"name":"sudharani","age":25}
series_data=pd.Series(my_dict)
series_data

name    sudharani
age            25
dtype: object

# Data frame

In [87]:
my_dict={"course":["python","c","nodejs"],"fees":[20,30,10]}

data=pd.DataFrame(my_dict)
data

   course  fees
0  python    20
1       c    30
2  nodejs    10

In [88]:
data=pd.DataFrame(my_dict,index=["Day1","Day2","Day3"])
data

      course  fees
Day1  python    20
Day2       c    30
Day3  nodejs    10

In [89]:
data["place"]=["pondy","cuddalore","vilupuram"]
data

      course  fees      place
Day1  python    20      pondy
Day2       c    30  cuddalore
Day3  nodejs    10  vilupuram

In [90]:
data

      course  fees      place
Day1  python    20      pondy
Day2       c    30  cuddalore
Day3  nodejs    10  vilupuram

In [91]:
data

      course  fees      place
Day1  python    20      pondy
Day2       c    30  cuddalore
Day3  nodejs    10  vilupuram

In [92]:
data.drop("place",axis=1)

      course  fees
Day1  python    20
Day2       c    30
Day3  nodejs    10

In [93]:
data

      course  fees      place
Day1  python    20      pondy
Day2       c    30  cuddalore
Day3  nodejs    10  vilupuram

In [94]:
#inplace = true

In [95]:
data.drop("place",axis=1,inplace=True)

In [96]:
#loc - location

In [97]:
data.loc["Day2"]

course     c
fees      30
Name: Day2, dtype: object

In [98]:
data.iloc[0]

course    python
fees          20
Name: Day1, dtype: object

In [99]:
data.loc["Day2","course"]

'c'

In [100]:
#index reset

data.reset_index()

  index  course  fees
0  Day1  python    20
1  Day2       c    30
2  Day3  nodejs    10

In [101]:
data=[1,2,3,3,1,12,1212,31,12,0,-2,-2]
data=pd.DataFrame(data)
data

       0
0      1
1      2
2      3
3      3
4      1
5     12
6   1212
7     31
8     12
9      0
10    -2
11    -2

In [102]:
data>0

        0
0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9   False
10  False
11  False